Revit 2024 API
BuiltInFailures.RebarCouplerFailures.MainEngagementParameterWarning Property
 This is used to post warning. "Bar Engagement 1" has an incorrect value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MainEngagementParameterWarning { get; }
Visual Basic
Public Shared ReadOnly Property MainEngagementParameterWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MainEngagementParameterWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace